public class HW {
//    1. Настроить рабочее окружение (установить Apache
//Tomcat, настроить Tomcat в Intelij Idea).
//            2. Создать Ваше первое web-приложение, которое будет
//    содержать класс-сервлет, выводящий информацию о
//    математических вычислениях.
//            3. Для выполнения математических вычислений
//    необходимо создать отдельный класс Calculator и
//    реализовать в нем все базовые математические
//    операции.
//4. Сервлет должен возвращать html страницу с
//    результатами математических операций.


//1. Создать страницу логина с формой ввода имени
//    пользователя и пароля.
//2. Создать сервлет для обработки формы логина и
//    определения пользователя (можно использовать
//предустановленные значения имени и пароля, в БД нет
//                                      необходимости).
//            3. Создать защищенную страницу, попасть на которую
//    можно только после логина.
//            4. Все запросы к защищенной странице должны приводить
//    к перенаправлению на страницу логина, если
//    пользователь еще не залогинен, а если залогинен –
//    должны всегда быть успешными.

}
